## Importing Data

In [54]:
import pandas as pd
import numpy as np

data = pd.read_csv('Data/Advertising.csv')
data

     Unnamed: 0     TV  Radio  Newspaper  Sales
0             1  230.1   37.8       69.2   22.1
1             2   44.5   39.3       45.1   10.4
2             3   17.2   45.9       69.3    9.3
3             4  151.5   41.3       58.5   18.5
4             5  180.8   10.8       58.4   12.9
..          ...    ...    ...        ...    ...
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

[200 rows x 5 columns]

In [55]:
data = data.apply(pd.to_numeric, errors='coerce')

data

     Unnamed: 0     TV  Radio  Newspaper  Sales
0             1  230.1   37.8       69.2   22.1
1             2   44.5   39.3       45.1   10.4
2             3   17.2   45.9       69.3    9.3
3             4  151.5   41.3       58.5   18.5
4             5  180.8   10.8       58.4   12.9
..          ...    ...    ...        ...    ...
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

[200 rows x 5 columns]

In [56]:
# Checking for null values column wise
data.isnull().sum()

Unnamed: 0    0
TV            0
Radio         0
Newspaper     0
Sales         0
dtype: int64

### Making the sales_type column

In [57]:
sales_type = []

for i in data['Sales']:
    if(i>=15):
        sales_type.append('High')
    elif(i<15 and i>=5):
        sales_type.append('Medium')
    else:
        sales_type.append('Low')

In [58]:
sales_type = pd.DataFrame(sales_type, columns = ['Sales Type'])
sales_type

    Sales Type
0         High
1       Medium
2       Medium
3         High
4       Medium
..         ...
195     Medium
196     Medium
197     Medium
198       High
199     Medium

[200 rows x 1 columns]

### Concatenation

In [59]:
df = [data, sales_type]
data = pd.concat(df, axis = 1)

In [60]:
data

     Unnamed: 0     TV  Radio  Newspaper  Sales Sales Type
0             1  230.1   37.8       69.2   22.1       High
1             2   44.5   39.3       45.1   10.4     Medium
2             3   17.2   45.9       69.3    9.3     Medium
3             4  151.5   41.3       58.5   18.5       High
4             5  180.8   10.8       58.4   12.9     Medium
..          ...    ...    ...        ...    ...        ...
195         196   38.2    3.7       13.8    7.6     Medium
196         197   94.2    4.9        8.1    9.7     Medium
197         198  177.0    9.3        6.4   12.8     Medium
198         199  283.6   42.0       66.2   25.5       High
199         200  232.1    8.6        8.7   13.4     Medium

[200 rows x 6 columns]

In [69]:
data_gb = data.groupby(['Sales Type']).mean()

In [70]:
data_gb

            Unnamed: 0          TV      Radio  Newspaper      Sales
Sales Type
High         97.532468  213.893506  33.689610  35.332468  19.490909
Low          98.666667    4.466667  17.766667   5.133333   3.200000
Medium      102.450000  107.710833  16.711667  28.123333  10.784167